---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionsEnabled
source: html/b82cc53e-a9b7-fa25-ede9-2c56017e62ab.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.AngularDimensionsEnabled Property

Identifies if any angular dimensions will be shown or not.

## Syntax (C#)
```csharp
public bool AngularDimensionsEnabled { get; set; }
```